# This Notebook will cover the following topics:

pandas basics
accessing elements using indexing
getting CSV data
getting HTML data
pandas operations
apply functions
sorting and ordering
Concatenating and merging
 

PANDAS BASICS
pandas series is a data type that can be accessed using label
Data can also be stored using pandas DataFrame.
Series Vs. DataFrame? Series is considered a single column of a DataFrame.

In [44]:
import pandas as pd

In [45]:
my_list=['apple','banana','chikoo']
label=[1,2,3]
my_list

['apple', 'banana', 'chikoo']

In [46]:
x=pd.Series(data=my_list,index=label)

In [47]:
x

1     apple
2    banana
3    chikoo
dtype: object

In [48]:
a={"emp id":[10,20,30],"emp name":["sbg",'abc','pqr'],
   'salary $/h':[100,200,300],'emp exp':[5,8,2]}

In [49]:
df=pd.DataFrame(a)
df

   emp id emp name  salary $/h  emp exp
0      10      sbg         100        5
1      20      abc         200        8
2      30      pqr         300        2

In [50]:
df['emp id']

0    10
1    20
2    30
Name: emp id, dtype: int64

In [51]:
df.to_csv("1dataframe.csv")
df.head(1)

   emp id emp name  salary $/h  emp exp
0      10      sbg         100        5

# Accessing element using indexing

In [52]:
x[1]

'apple'

In [132]:
#getting csv data
df=pd.read_csv("1dataframe.csv")
df

   Unnamed: 0  emp id emp name  salary $/h  emp exp
0           0      10      sbg         100        5
1           1      20      abc         200        8
2           2      30      pqr         300        2

In [133]:
#reading files from html link
#df=pd.read_html("https://www.livingin-canada.com/house-prices-canada.html")

In [134]:
#df=df[0]#[0] index for table 1

In [135]:
#df

In [136]:
#df.head()

In [137]:
#df.tail()

In [138]:
#df

In [139]:
df["a1"]=[1,2,3]
df

   Unnamed: 0  emp id emp name  salary $/h  emp exp  a1
0           0      10      sbg         100        5   1
1           1      20      abc         200        8   2
2           2      30      pqr         300        2   3

In [140]:
df["b"]=df["a1"]+1

In [141]:
df

   Unnamed: 0  emp id emp name  salary $/h  emp exp  a1  b
0           0      10      sbg         100        5   1  2
1           1      20      abc         200        8   2  3
2           2      30      pqr         300        2   3  4

In [142]:
df.columns

Index(['Unnamed: 0', 'emp id', 'emp name', 'salary $/h', 'emp exp', 'a1', 'b'], dtype='object')

In [143]:
#arranging columns
df=df[['emp id','emp name','emp exp', 'b', 'a1']]

In [144]:

df

   emp id emp name  emp exp  b  a1
0      10      sbg        5  2   1
1      20      abc        8  3   2
2      30      pqr        2  4   3

In [145]:
df.shape

(3, 5)

In [146]:
del df['emp id'] #for deleting specific columns

In [147]:
df

  emp name  emp exp  b  a1
0      sbg        5  2   1
1      abc        8  3   2
2      pqr        2  4   3

In [148]:
df.columns

Index(['emp name', 'emp exp', 'b', 'a1'], dtype='object')

In [149]:
df

  emp name  emp exp  b  a1
0      sbg        5  2   1
1      abc        8  3   2
2      pqr        2  4   3

In [150]:
df.drop(['a1','b'],axis=1,inplace=True)#inplace=true for permenant modification

  emp name  emp exp
0      sbg        5
1      abc        8
2      pqr        2

In [152]:
df

  emp name  emp exp  b  a1
0      sbg        5  2   1
1      abc        8  3   2
2      pqr        2  4   3

In [153]:
df.columns

Index(['emp name', 'emp exp', 'b', 'a1'], dtype='object')